# CreatePatternPopup

## Description
Create a pattern popup dialog control that displays all fill patterns available in current document.

```pascal
PROCEDURE CreatePatternPopup(
				dialogID : LONGINT;
				itemID   : LONGINT);
```

```python
def vs.CreatePatternPopup(dialogID, itemID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|   |
|itemID|LONGINT|   |

## Version
Availability: from VectorWorks12.0

## Category
* Dialogs - Modern